Revit 2024 API
Railing.CanReset Property
 True if the railing can be reset, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanReset { get; }
Visual Basic
Public ReadOnly Property CanReset As Boolean
	Get
Visual C++
public:
property bool CanReset {
	bool get ();
}
Remarks
 A Railing can be reset only if the railing was created in Revit later than version 9.1.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace